tap 'golangci/tap'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/services'
brew 'python@3.11', link: true
brew 'awscli'
brew 'python@3.9', link: false
brew 'cloc'
brew 'colima'
brew 'coreutils'
brew 'curl'
brew 'dive'
brew 'docker', link: :overwrite
brew 'dos2unix'
brew 'ffmpeg'
brew 'git'
brew 'go'
brew 'python@3.10', link: false
brew 'gource'
brew 'graphviz'
brew 'html-xml-utils'
brew 'imagemagick'
brew 'jq'
brew 'mysql', restart_service: true
brew 'nginx', restart_service: true
brew 'node@18', link: :overwrite
brew 'openssl@3'
brew 'php@8.1', restart_service: true, link: true
brew 'redis', restart_service: true
brew 'vim'
brew 'golangci/tap/golangci-lint'
cask 'aerial'
cask 'dotnet-sdk'
cask 'firefox'
cask 'gimp'
cask 'microsoft-auto-update'
cask 'microsoft-edge'
cask 'mono-mdk-for-visual-studio'
cask 'omnidisksweeper'
cask 'opera'
cask 'redisinsight'
cask 'sqlworkbenchj'
cask 'temurin8'
cask 'visual-studio'
cask 'visual-studio-code'
