aliasadidev.nugetpackagemanagergui
bierner.markdown-mermaid
dbaeumer.vscode-eslint
eamodio.gitlens
ecodes.vscode-phpmd
editorconfig.editorconfig
flowtype.flow-for-vscode
github.copilot
github.copilot-chat
github.vscode-github-actions
humao.rest-client
jmrog.vscode-nuget-package-manager
ms-azuretools.vscode-docker
ms-dotnettools.csdevkit
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-dotnettools.vscodeintellicode-csharp
ms-playwright.playwright
pkief.material-icon-theme
psioniq.psi-header
redhat.vscode-commons
redhat.vscode-yaml
ryanolsonx.zenburn
shevaua.phpcs
styled-components.vscode-styled-components
unifiedjs.vscode-mdx
usernamehw.errorlens
vs-publisher-1464889.veracode-greenlight-for-vs-code
whatwedo.twig
zobo.php-intellisense
